---
kind: property
id: P:Autodesk.Revit.DB.Structure.AreaLoad.NumRefPoints
source: html/8f5aea83-d302-f0a0-5e8a-57141b0f6549.htm
---
# Autodesk.Revit.DB.Structure.AreaLoad.NumRefPoints Property

Returns the total number of reference points for the area load.

## Syntax (C#)
```csharp
public int NumRefPoints { get; }
```